Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: PID is the unique number which identifies a Process.
fr: Le PID est le numéro unique qui identifie un processus.

source: A PID can be obtained through the ProcessExists() or Run() commands.
fr: Un PID peut être obtenu par les commandes ProcessExists() ou Run().

source: The process is polled approximately every 250 milliseconds.
fr: Le processus est sondé toutes les 250 millisecondes environ.

source: Checks to see if a specified process exists.
fr: Vérifie si un processus spécifié existe.

source: The name or PID of the process to check.
fr: Le nom ou PID du processus à vérifier.

source: the PID of the process.
fr: Retourne le PID du processus.

source: 0 if process does not exist.
fr: Retourne 0 si le processus n'existe pas.

source: Check if the Notepad process is running.
fr: Vérifie si le processus Notepad est en cours d'exécution.

source: Returns an array about Memory or IO infos of a running process.
fr: Retourne un tableau sur la mémoire ou des infos IO sur le processus en cours d'exécution.

source: The name or PID of the process to get infos from.
fr: Le nom ou le PID du processus dont on veut obtenir des infos de.

source: Default (-1) is the current process.
fr: Par défaut (-1) est le processus courant.

source: 0 = (default) memory infos, 1 = IO infos.
fr: 0 = (par défaut ) infos de mémoire, 1 = infos IO.

source: an array of infos data (See Remarks).
fr: Retourne un tableau de données d'infos (Voir Remarques).

source: The array returned is mono-dimensional and is made up as follows:
fr: Le tableau renvoyé est unidimensionnel et se compose comme suit:

source: Memory Stats
fr: Mémoire Statistiques

source: IO Stats
fr: IO Statistiques

source: $aArray[0] = number of read operations performed.
fr: $aArray[0] = nombre d'opérations de lecture effectuées.

source: $aArray[1] = number of write operations performed.
fr: $aArray[1] = nombre d'opérations d'écriture effectuée.

source: $aArray[2] = number of I/O operations performed, other than read and write operations.
fr: $aArray[2] = nombre d'opérations d'E/S effectuée, autre que lecture et d'écriture.

source: $aArray[3] = number of bytes read.
fr: $aArray[3] = nombre d'octets lus.

source: $aArray[4] = number of bytes write.
fr: $aArray[4] = nombre d'octets écrits.

source: $aArray[5] = number of bytes transferred during operations other than read and write operations.
fr: $aArray[5] = nombre d'octets transférés pendant les opérations autres que lecture et d'écriture.

source: Retrieve memory details about the current process.
fr: Récupèrer les détails de la mémoire sur le processus en cours.

source: If $aMemory is an array then display the following details about the process.
fr: Si $aMemory est un tableau, alors affiche les informations suivantes sur le processus.

source: Returns an array listing the currently running processes (names and PIDs).
fr: Retourne un tableau listant les processus en cours d'exécution (noms et PIDs).

source: If a name is given only processes of the same name will be returned.
fr: Si un nom est donné, seul les processus de même nom seront retournés.

source: an array of process names and PIDs (See Remarks).
fr: Retourne le tableau des noms de processus et leur PID (Voir Remarques).

source: sets the @error flag to 1 when the array cannot be built.
fr: Retourne @error = 1 lorsque la liste ne peut pas être construite.

source: The array returned is two-dimensional and is made up as follows:
fr: Le tableau retourné est bi-dimensionnel et se compose comme ceci:

source: $aArray[0][0] = Number of processes
fr: $array[0][0] = Nombre de processus

source: $aArray[1][0] = 1st Process name
fr: $array[1][0] = Nom du 1er processus

source: $aArray[1][1] = 1st Process ID (PID)
fr: $array[1][1] = ID (PID) du 1er processus

source: $aArray[2][0] = 2nd Process name
fr: $array[2][0] = Nom du 2nd processus

source: $aArray[2][1] = 2nd Process ID (PID)
fr: $array[2][1] = ID (PID) du 2nd processus

source: $aArray[n][0] = nth Process name
fr: $array[n][0] = Nom du n-ième processus

source: $aArray[n][1] = nth Process ID (PID)
fr: $array[n][1] = ID (PID) du n-ième processus

source: The list can be empty if $aArray[0][0] = 0.
fr: La liste peut être vide si $array[0][0] = 0.

source: No @error set in this case.
fr: Dans ce cas aucune @error n'est déterminée.

source: Display a list of Notepad processes returned by ProcessList.
fr: Affiche la liste des processus Bloc-notes renvoyées par PROCESSLIST.

source: Changes the priority of a process.
fr: Modifie la priorité d'un processus.

source: A flag which determines what priority to set
fr: Un drapeau qui détermine la priorité à installer

source: 0 = Idle/Low
fr: 0 = veille/Basse

source: 1 = Below Normal
fr: 1 = Inférieur à la normale

source: 3 = Above Normal
fr: 3 = Au dessus de la normale

source: 4 = High
fr: 4 = Haute

source: 5 = Realtime (Use with caution, may make the system unstable)
fr: 5 = temps réel (utiliser avec prudence, peut rendre le système instable)

source: 2 if attempting to use an unsupported priority class.
fr: 2 si vous tentez d'utiliser une classe de priorité non prise en charge.

source: Set the priority of the Notepad process to "Idle/Low".
fr: Définit la priorité du processus du Bloc-notes à "Idle/Low".

source: Pauses script execution until a given process exists.
fr: Met en pause l'exécution du script jusqu'à ce qu'un processus donné existe.

source: The name of the process to check.
fr: Le nom du processus à vérifier.

source: Specifies how long to wait (in seconds).
fr: Spécifie la durée d'attente (en secondes).

source: Default is to wait indefinitely.
fr: Par défaut attend indéfiniment.

source: the Pid of the process.
fr: Retourne le PID du processus.

source: 0 if the wait timed out.
fr: Retourne 0 si l'attente a expiré.

source: This function is the only process function not to accept a PID.
fr: Cette fonction est la seule fonction de processus qui n'accepte pas un PID.

source: Because PIDs are allocated randomly, waiting for a particular PID to exist doesn't make sense.
fr: Parce que les PID sont alloués de façon aléatoire, attendre qu'un PID particulier existe n'a pas de sens.

source: Wait for the Notepad process to exist.
fr: Attend que le processus du Bloc-notes existe.

source: Pauses script execution until a given process does not exist.
fr: Met en pause l'exécution du script jusqu'à ce qu'un processus donné n'existe plus.

source: 1 and sets @extended to the exit code of the process.
fr: Retourne 1 et définit @extended avec le code de sortie du processus.

source: On invalid PID the @error flag is set to non-zero and @extended is set to 0xCCCCCCCC.
fr: Si le PID est invalide @error n'est pas nul - et @extended = 0xCCCCCCCC.

source: The return is 1 if the process was not existing.
fr: Le retour est 1 si le processus n'existait pas.

source: Wait until no instance of Notepad exists.
fr: Attend jusqu'à ce que aucune instance de notepad existe.

source: Wait until this particular instance of Notepad is closed by the user.
fr: Attend jusqu'à ce que cet instance particulière de Notepad soit fermé par l'utilisateur.

source: Display a progress bar window.
fr: Affiche une fenêtre de barre de progression.

source: Update the progress value of the progress bar window every second.
fr: Met à jour la valeur de la progression de la fenêtre de la barre de progression à chaque seconde.

source: Set the "subtext" and "maintext" of the progress bar window.
fr: Réglez le \" sous-texte \" et \" mainText \" de la fenêtre de la barre de progression.

source: Close the progress window.
fr: Ferme la fenêtre de progression.

source: Title for progress window.
fr: Titre de la fenêtre de progression.

source: Text for Main, Bold, Upper label.
fr: Texte pour Main, Bold, Upper label.

source: text for Sub, Normal, Lower label.
fr: texte pour Sub, Normal, Lower label.

source: (default is blank)
fr: (par défaut est vide)

source: position from left (in pixels) of progress window.(default is centered)
fr: Abscisse du coin NW (en pixels) de la fenêtre de progression (par défaut elle est centrée).

source: position from top (in pixels) of progress window.(default is centered)
fr: Ordonnée du coin NW (en pixels) de la fenêtre de progression (par défaut elle est centrée)

source: Default is 'always on top/with title'
fr: Par défaut elle est 'toujours OnTop/avec titre'

source: Add up the following options you want:
fr: Ajouter les options suivantes que vous voulez :

source: $DLG_NOTITLE (1) = borderless, titleless window
fr: $ DLG_NOTITLE (1) = Fenêtre sans bordure et sans titre

source: $DLG_NOTONTOP (2) = Without "always on top" attribute
fr: $ DLG_NOTONTOP (2) = Sans l'attribut "toujours OnTop"

source: $DLG_MOVEABLE (16) = Window can be moved
fr: $ DLG_MOVEABLE (16) = Fenêtre déplaçable

source: To skip an optional parameter, leaving its default value intact, use:
fr: Pour passer un paramètre optionnel, en laissant sa valeur par défaut intacte, utilisez :

source: "" for string parameters
fr: "" Pour les paramètres chaîne

source: -1 for numeric parameters
fr: -1 Pour les paramètres numériques

source: If ProgressOn() is called while a progress window already exists, the window is redrawn/moved.
fr: Si ProgressOn() est appelée alors qu'une fenêtre de progression existe déjà, la fenêtre est redessinée/déplacé.

source: (If you want multiple simultaneous progress windows, you need to use multiple scripts.)
fr: (Si vous voulez plusieurs fenêtres de progression simultanées, vous devez utiliser plusieurs scripts.)

source: Percentage (value between 0.
fr: Pourcentage (valeur comprise entre 0.

source: and 100.) to set the progress bar at.
fr: et 100.)pour régler la barre de progression.

source: Set the text for the Sub, Normal, Lower label.
fr: Sélectionnez le texte pour le Sub, Normale, Lower label.

source: Set the text for the Main, Bold, Upper label.
fr: Sélectionnez le texte pour le Main, Bold, Upper label.

source: Notice that the subtext argument comes before maintext.
fr: Notez que l'argument de sous-texte vient avant mainText.

source: Converts an expression into a pointer variant.
fr: Convertit une expression en un pointeur de type 'variant'.

source: An expression to convert into a pointer variant.
fr: Une expression à convertir en un pointeur de type 'variant'.

source: Returns the pointer representation of the expression.
fr: Retourne la représentation en pointeur de l'expression.

source: Convert -1 to a pointer expression.
fr: Convertit -1 en une expression pointeur.

source: Test if $hPtr is a valid pointer and display the results.
fr: Teste si $pPtr est un pointeur valide et afficher le résultat.

source: Generates a pseudo-random float-type number.
fr: Génère un nombre pseudo-aléatoire de type 'float'.

source: The smallest number to be generated.
fr: Le plus petit nombre qui peut être généré.

source: The default is 0.
fr: La valeur par défaut est 0.

source: The largest number to be generated.
fr: Le plus grand nombre qui peut être généré.

source: The default is 1.
fr: La valeur par défaut est 1.

source: If this is set to 1 then an integer result will be returned.
fr: S'il est mis à 1, un résultat de type 'integer' sera retourné.

source: Default is a floating point number.
fr: Par défaut c'est un nombre de type 'float'.

source: a pseudo-random number between Min and Max.
fr: Retourne un nombre pseudo-aléatoire entre Min et Max.

source: If only one argument is provided, then this is interpreted to be the Max parameter.
fr: Si un seul argument est fourni, il est considéré comme le paramètre Max.

source: The result will be in the range of Min to Max INCLUSIVE when using integers (just short of Max when using floats).
fr: Le résultat sera dans l'intervalle de Min à Max, bornes INCLUSES lors de l'utilisation des résultats de type 'integer' (un peu moins du Max lorsqu'il s'agit de 'float').

source: If Min and Max are the same value then Random() will return 0 and sets the @error flag to non-zero.
fr: Si Min et Max ont la même valeur alors Random() retournera 0 et @error <> 0.

source: When using integers Max-Min must be less than 2^31.
fr: Quand on utilise des 'integers' Min et MAx doivent être inférieurs à 2^31.

source: Comments based on the original source
fr: Commentaires relatifs à l'origine de la source

source: This function uses the Mersenne Twister random number generator, MT19937, written by Takuji Nishimura, Makoto Matsumoto, Shawn Cokus, Matthe Bellew and Isaku Wada.
fr: Cette fonction utilise le générateur de nombre aléatoire Mersenne Twister, MT19937, écrit par Takuji Nishimura, Makoto Matsumoto, Shawn Cokus, Matthe Bellew et Isaku Wada.

source: The Mersenne Twister is an algorithm for generating random numbers.
fr: Le Mersenne Twister est un algorithme de génération de nombres aléatoires.

source: It was designed with consideration of the flaws in various other generators.
fr: Il a été conçu en tenant compte des failles de divers autres générateurs.

source: The period, 219937-1, and the order of equidistribution, 623 dimensions, are far greater.
fr: La période, 219937-1 et l'ordre de l'équidistribution, 623 dimensions, sont beaucoup plus grands.

source: The generator is also fast; it avoids multiplication and division, and it benefits from caches and pipelines.
fr: Le générateur est également rapide, il évite la multiplication et la division, et bénéficie de mémoire cache et de plusieurs canaux de traitement.

source: For more information see the inventors' web page at http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.html
fr: Pour plus d'informations, voir la page web des inventeurs à http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.html

source: Copyright (C) 1997 - 2002, Makoto Matsumoto and Takuji Nishimura, All rights reserved.
fr: Copyright © 1997 - 2002, Makoto Matsumoto et Takuji Nishimura, Tous droits réservés.

source: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
fr: La redistribution et l'utilisation des codes source et binaire, avec ou sans modification, sont autorisées à condition que les conditions suivantes soient remplies :

source: Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
fr: Les redistributions du code source doivent conserver la notice de copyright ci-dessus, cette liste de conditions et la décharge suivante.

source: Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
fr: Les redistributions sous forme binaire doivent reproduire la notice de copyright ci-dessus, cette liste de conditions et la décharge suivante dans la documentation et/ou d'autres documents fournis avec la distribution.

source: The names of its contributors may not be used to endorse or promote products derived from this software without specific prior written permission.
fr: Les noms de ses contributeurs ne peuvent être utilisés pour avaliser ou promouvoir des produits dérivés de ce logiciel sans autorisation écrite spécifique préalable.

source: THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
fr: CE LOGICIEL EST FOURNI PAR LES DÉTENTEURS DE DROITS D'AUTEURS ET LES CONTRIBUTEURS "TEL QUEL" ET TOUTE GARANTIE EXPLICITE OU IMPLICITE, Y COMPRIS MAIS SANS LIMITATION DE GARANTIE IMPLICITE DE VALEUR MARCHANDE ET D'ADAPTATION À UN USAGE PARTICULIER SONT RÉFUTÉS.

source: IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
fr: EN AUCUN CAS LE PROPRIÉTAIRE DES DROITS D'AUTEUR OU LES CONTRIBUTEURS NE SAURAIENT ÊTRE TENUS RESPONSABLES DE TOUT DOMMAGE DIRECT, INDIRECT, ACCESSOIRE, SPÉCIAL, DOMMAGES ET INTÉRÊTS OU DOMMAGES CONSÉCUTIFS (Y COMPRIS MAIS SANS LIMITATION FOURNITURE DE MARCHANDISES OU SERVICES DE SUBSTITUTION ; PERTE DE JOUISSANCE, DE DONNÉES OU DE BÉNÉFICES ; NI INTERRUPTION D'ACTIVITÉ) QUELLES QUE SOIENT LEURS CAUSES ET QUEL QUE SOIT LE MOTIF JURIDIQUE INVOQUÉ, CONTRACTUEL, RESPONSABILITÉ CIVILE OU PÉNALE (Y COMPRIS NÉGLIGENCE OU AUTRE), SURVENANT DE QUELQUE MANIÈRE QUE CE SOIT SUITE À L'UTILISATION DU LOGICIEL, MÊME S'ILS ONT ÉTÉ AVISÉS DE LA POSSIBILITÉ DE TELS DOMMAGES.

source: Flip a coin.
fr: Lancé d'une pièce.

source: Return an integer between 0 and 1.
fr: Retourne un nombre entier compris entre 0 et 1.

source: If the random integer was 1 then heads was thrown.
fr: Si le nombre aléatoire est 1 alors Face à été obtenu.

source: If the random integer was 0 then tails was thrown.
fr: Si le nombre aléatoire est 0, alors Pile a été obtenu.

source: Roll a die.
fr: Lancé d'un dé.

source: Return an integer between 1 and 6.
fr: Retourne un nombre entier compris entre 1 et 6.

source: Create a random string of text.
fr: Crée une chaîne aléatoire de texte.

source: Return an integer between 5 and 20 to determine the length of the string.
fr: Retourne un nombre entier compris entre 5 et 20 pour déterminer la longueur de la chaîne.

source: Return an integer between 65 and 122 which represent the ASCII characters between a (lower-case) to Z (upper-case).
fr: Retourne un nombre entier compris entre 65 et 122 qui représentent les caractères ASCII entre 'a' (minuscule) à 'Z' (en majuscule).

source: Display the string of text.
fr: Affiche la chaîne de texte.

source: Result of when Min and Max are the same value.
fr: Résultat où Min et Max ont la même valeur.

source: Deletes a key or value from the registry.
fr: Supprime une clé ou une valeur dans le registre.

source: The registry key to delete.
fr: La clé de registre à supprimer.

source: The valuename to delete.
fr: La valeur à supprimer.

source: 0 if the key/value does not exist.
fr: Retourne 0 si la clé/valeur n'existe pas.

source: 2 if error deleting key/value and sets the @error flag to non-zero.
fr: Retourne 2 si erreur lors de la suppression et @error <> 0.

source: 1 = unable to open requested key
fr: 1 = impossibilité d'ouvrir la clé demandée

source: 2 = unable to open requested main key
fr: 2 = impossibilité d'ouvrir la clé principale

source: 3 = unable to remote connect to the registry
fr: 3 = impossibilité de se connecter au registre distant

source: -1 = unable to delete requested value
fr: -1 = impossibilité de supprimer la valeur demandée

source: -2 = unable to delete requested key/value
fr: -2 = impossibilité de supprimer la clé/valeur demandée

source: A registry key must start with "HKEY_LOCAL_MACHINE" ("HKLM") or "HKEY_USERS" ("HKU") or "HKEY_CURRENT_USER" ("HKCU") or "HKEY_CLASSES_ROOT" ("HKCR") or "HKEY_CURRENT_CONFIG" ("HKCC").
fr: Une clé de registre doit commencer par "HKEY_LOCAL_MACHINE" ("HKLM") ou "HKEY_USERS" ("HKU") ou "HKEY_CURRENT_USER" ("HKCU") ou "HKEY_CLASSES_ROOT" ("HKCR") ou "HKEY_CURRENT_CONFIG" ("HKCC").

source: When running on 64-bit Windows if you want to delete a key or value specific to the 64-bit environment you have to suffix the HK... with 64 i.e.
fr: Dans un système Windows 64-bits, si vous souhaitez supprimer une clé ou une valeur spécifique à l'environnement 64-bits, il est nécessaire de faire suivre HK...par 64.

source: HKLM64.
fr: Par exemple :HKLM64.

source: To access the (Default) value use "" (an empty string) for the valuename.
fr: Pour atteindre la valeur (par défaut), utilisez "" (une chaine vide) en paramètre valuename.

source: Deleting from the registry is potentially dangerous--please exercise caution!
fr: Supprimer une clé dans le registre est potentiellement dangereux -- A utiliser avec précaution!

source: It is possible to access remote registries by using a keyname in the form "\\computername\keyname".
fr: Il est possible d'accéder à des registres distants en utilisant un nom de clé sous la forme "\\ordinateur\clé".

source: To use this feature you must have the correct access rights.
fr: Pour utiliser cette fonctionnalité, vous devrez avoir les bons droits d'accès.

source: Reads the name of a subkey according to its instance.
fr: Lit le nom d'une sous-clé dont l'instance est donnée.

source: The registry key to read.
fr: La clé de registre à lire.

source: The 1-based key instance to retrieve
fr: L'instance, à partir de 1, à récupérer

source: the requested subkey name.
fr: Retourne le nom de la sous-clé demandée.

source: -1 = unable to retrieve requested subkey (key instance out of range)
fr: -1 = impossible de récupérer la sous-clé demandée (instance de la clé en dehors de la plage)

source: When running on 64-bit Windows if you want to enum a key specific to the 64-bit environment you have to suffix the HK... with 64 i.e.
fr: Lors de l'exécution sur Windows 64 bits si vous voulez lire une clé spécifique à l'environnement 64 bits, vous devez suffixer HK...

source: Reads the name of a value according to its instance.
fr: Lit le nom d'une valeur dont l'instance est donnée.

source: The 1-based value instance to retrieve
fr: L'instance de la valeur, à partir de 1, à récupérer

source: the requested registry value.
fr: Retourne la valeur de Registre demandé.

source: @extended is set to the type of the value.
fr: @extended contient le type de la valeur.

source: -1 = unable to retrieve requested value name (value instance out of range)
fr: -1 = impossible de récupérer le nom de la valeur demandée ( instance de valeur en dehors de la plage)

source: When running on 64-bit Windows if you want to enum a value specific to the 64-bit environment you have to suffix the HK... with 64 i.e.
fr: Lors de l'exécution sur Windows 64 bits si vous voulez lire une valeur spécifique à l'environnement 64 bits, vous devez suffixer HK...

source: Registry functions Reference
fr: Registry - Référence Fonctions

source: Reads a value from the registry.
fr: Lit une valeur dans le Registre.

source: Creates a key or value in the registry.
fr: Crée une clé ou une valeur dans le registre.

source: The value to read.
fr: La valeur à lire.

source: @extended is set to the type of the value $REG_... .
fr: @extended contient le type de la valeur $REG_....

source: These types are defined in the "Constants.au3" include file.
fr: Ces types sont définis dans le fichier 'include' "Constants.au3".

source: -1 = unable to open requested value
fr: -1 = impossible d'ouvrir la valeur demandée

source: -2 = value type not supported
fr: -2 = type de valeur non pris en charge

source: When running on 64-bit Windows if you want to read a value specific to the 64-bit environment you have to suffix the HK... with 64 i.e.
fr: Lors de l'exécution sur Windows 64 bits si vous souhaitez lire une valeur spécifique à l'environnement 64 bits, vous devez suffixer HK...

source: AutoIt supports registry keys of type REG_BINARY, REG_SZ, REG_MULTI_SZ, REG_EXPAND_SZ, REG_QWORD, and REG_DWORD.
fr: AutoIt supporte les clés de Registre de type REG_BINARY, REG_SZ, REG_MULTI_SZ, REG_EXPAND_SZ, REG_QWORD, et REG_DWORD.

source: When reading a REG_BINARY key the result is a binary datatype (in previous versions it was a string of hex characters).
fr: Lors de la lecture d'une clé REG_BINARY le résultat est un type de données binaire (dans les versions précédentes, il était une chaîne de caractères hexadécimaux ).
